### YOLO26l (YOLOv11-based) with Coordinate Attention
nc: 80
scales:
  l: [1.00, 1.00, 512]  # depth=1.0, width=1.0, max_channels=512

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,    [64, 3, 2]]               # 0-P1/2      → 64ch
  - [-1, 1, Conv,    [128, 3, 2]]              # 1-P2/4      → 128ch
  - [-1, 2, C3k2,    [256, True, 0.25]]        # 2           → 256ch
  - [-1, 1, Conv,    [256, 3, 2]]              # 3-P3/8      → 256ch
  - [-1, 2, C3k2,    [512, True, 0.25]]        # 4           → 512ch  (P3)
  - [-1, 1, Conv,    [512, 3, 2]]              # 5-P4/16     → 512ch
  - [-1, 2, C3k2,    [512, True]]              # 6           → 512ch  (P4)
  - [-1, 1, Conv,    [512, 3, 2]]              # 7-P5/32     → 512ch
  - [-1, 2, C3k2,    [512, True]]              # 8           → 512ch
  - [-1, 1, SPPF,    [512, 5]]                 # 9           → 512ch
  - [-1, 1, C2PSA,   [512, 2]]                 # 10          → 512ch

  # CoordAtt injection at end of backbone
  - [-1, 1, CoordAtt, [512]]                   # 11          → 512ch

head:
  - [-1,       1, nn.Upsample, [None, 2, 'nearest']] # 12 | 512
  - [[-1, 6],  1, Concat,      [1]]                  # 13 | 512+512=1024
  - [-1,       2, C3k2,        [512, True]]           # 14 | →512  (P4)

  - [-1,       1, nn.Upsample, [None, 2, 'nearest']] # 15 | 512
  - [[-1, 4],  1, Concat,      [1]]                  # 16 | 512+512=1024
  - [-1,       2, C3k2,        [256, True]]           # 17 | →256  (P3/small)

  - [-1,       1, Conv,        [256, 3, 2]]           # 18 | →256
  - [[-1, 14], 1, Concat,      [1]]                  # 19 | 256+512=768
  - [-1,       2, C3k2,        [512, True]]           # 20 | →512  (P4/medium)

  - [-1,       1, Conv,        [512, 3, 2]]           # 21 | →512
  - [[-1, 11], 1, Concat,      [1]]                  # 22 | 512+512=1024 (skip from CoordAtt)
  - [-1,       1, C3k2,        [512, True, 0.5, True]]# 23 | →512  (P5/large)

  - [[17, 20, 23], 1, Detect,  [nc]]                 # 24
